# DECISION TREE

In [3]:
#load dataset
import pandas as pd
df=pd.read_csv("D:/ds datatechs/datasets/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
#drop the target column
inputs=df.drop(["Survived","PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"], axis='columns')
inputs
target=df["Survived"]

In [16]:
#let us convert the column into numerics. this is done with LabelEncoder
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [17]:
#create another column in df
inputs['Pclass_n']=le.fit_transform(inputs['Pclass'])
inputs['Sex_n']=le.fit_transform(inputs['Sex'])
inputs['Age_n']=le.fit_transform(inputs['Age'])
inputs['Fare_n']=le.fit_transform(inputs['Fare'])
inputs.head()

   Pclass     Sex   Age     Fare  Pclass_n  Sex_n  Age_n  Fare_n
0       3    male  22.0   7.2500         2      1     28      18
1       1  female  38.0  71.2833         0      0     51     207
2       3  female  26.0   7.9250         2      0     34      41
3       1  female  35.0  53.1000         0      0     47     189
4       3    male  35.0   8.0500         2      1     47      43

In [18]:
input_n=inputs.drop(['Pclass','Sex','Age', 'Fare'], axis="columns")
input_n

     Pclass_n  Sex_n  Age_n  Fare_n
0           2      1     28      18
1           0      0     51     207
2           2      0     34      41
3           0      0     47     189
4           2      1     47      43
..        ...    ...    ...     ...
886         1      1     35      85
887         0      0     24     153
888         2      0     88     131
889         0      1     34     153
890         2      1     42      30

[891 rows x 4 columns]

In [26]:
#take x and y
x=inputs[['Pclass_n','Sex_n','Age_n','Fare_n']]
x
y=df["Survived"]
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [27]:
#splitting x and y into training and testing
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2, random_state=1)

In [28]:
#create the model
from sklearn.tree import DecisionTreeClassifier

In [29]:
#default criterion='gini'. we can use criterion="entropy"
model=DecisionTreeClassifier()
model.fit(input_n,target)

DecisionTreeClassifier()

In [30]:
#making prediction on testing set
y_pred=model.predict([[2,1,28,18]])
y_pred

array([0], dtype=int64)

In the above prediction the model gives a array[0] it means that the person not survived.

In [31]:
y_pred=model.predict([[0,0,51,207]])
y_pred

array([1], dtype=int64)

array[1] means the person is survived.

In [32]:
#find accuraccy
accuraccy=model.score(input_n,target)
accuraccy

0.9797979797979798

Decision tree model gives a 97% accuraccy on titanic dataset.